solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/devices/MIMXRT798S/periph/PERI_CLKCTL3.h
/*
** ###################################################################
**     Processors:          MIMXRT735SGAWAR_cm33_core0
**                          MIMXRT735SGAWAR_cm33_core1
**                          MIMXRT735SGAWAR_ezhv
**                          MIMXRT735SGAWAR_hifi1
**                          MIMXRT735SGFOA_cm33_core0
**                          MIMXRT735SGFOA_cm33_core1
**                          MIMXRT735SGFOA_ezhv
**                          MIMXRT735SGFOA_hifi1
**                          MIMXRT758SGAWAR_cm33_core0
**                          MIMXRT758SGAWAR_cm33_core1
**                          MIMXRT758SGAWAR_ezhv
**                          MIMXRT758SGAWAR_hifi1
**                          MIMXRT758SGFOA_cm33_core0
**                          MIMXRT758SGFOA_cm33_core1
**                          MIMXRT758SGFOA_ezhv
**                          MIMXRT758SGFOA_hifi1
**                          MIMXRT798SGAWAR_cm33_core0
**                          MIMXRT798SGAWAR_cm33_core1
**                          MIMXRT798SGAWAR_ezhv
**                          MIMXRT798SGAWAR_hifi1
**                          MIMXRT798SGAWAR_hifi4
**                          MIMXRT798SGFOA_cm33_core0
**                          MIMXRT798SGFOA_cm33_core1
**                          MIMXRT798SGFOA_ezhv
**                          MIMXRT798SGFOA_hifi1
**                          MIMXRT798SGFOA_hifi4
**
**     Version:             rev. 2.0, 2024-05-28
**     Build:               b241121
**
**     Abstract:
**         CMSIS Peripheral Access Layer for CLKCTL3
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2024 NXP
**     SPDX-License-Identifier: BSD-3-Clause
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
**     Revisions:
**     - rev. 1.0 (2022-09-15)
**         Initial version.
**     - rev. 2.0 (2024-05-28)
**         Rev2 DraftA.
**
** ###################################################################
*/

/*!
 * @file CLKCTL3.h
 * @version 2.0
 * @date 2024-05-28
 * @brief CMSIS Peripheral Access Layer for CLKCTL3
 *
 * CMSIS Peripheral Access Layer for CLKCTL3
 */

#if !defined(CLKCTL3_H_)
#define CLKCTL3_H_                               /**< Symbol preventing repeated inclusion */

#if (defined(CPU_MIMXRT735SGAWAR_cm33_core0) || defined(CPU_MIMXRT735SGFOA_cm33_core0))
#include "MIMXRT735S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_cm33_core1) || defined(CPU_MIMXRT735SGFOA_cm33_core1))
#include "MIMXRT735S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_ezhv) || defined(CPU_MIMXRT735SGFOA_ezhv))
#include "MIMXRT735S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT735SGAWAR_hifi1) || defined(CPU_MIMXRT735SGFOA_hifi1))
#include "MIMXRT735S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_cm33_core0) || defined(CPU_MIMXRT758SGFOA_cm33_core0))
#include "MIMXRT758S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_cm33_core1) || defined(CPU_MIMXRT758SGFOA_cm33_core1))
#include "MIMXRT758S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_ezhv) || defined(CPU_MIMXRT758SGFOA_ezhv))
#include "MIMXRT758S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT758SGAWAR_hifi1) || defined(CPU_MIMXRT758SGFOA_hifi1))
#include "MIMXRT758S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_cm33_core0) || defined(CPU_MIMXRT798SGFOA_cm33_core0))
#include "MIMXRT798S_cm33_core0_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_cm33_core1) || defined(CPU_MIMXRT798SGFOA_cm33_core1))
#include "MIMXRT798S_cm33_core1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_ezhv) || defined(CPU_MIMXRT798SGFOA_ezhv))
#include "MIMXRT798S_ezhv_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_hifi1) || defined(CPU_MIMXRT798SGFOA_hifi1))
#include "MIMXRT798S_hifi1_COMMON.h"
#elif (defined(CPU_MIMXRT798SGAWAR_hifi4) || defined(CPU_MIMXRT798SGFOA_hifi4))
#include "MIMXRT798S_hifi4_COMMON.h"
#else
  #error "No valid CPU defined!"
#endif

/* ----------------------------------------------------------------------------
   -- Device Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup Peripheral_access_layer Device Peripheral Access Layer
 * @{
 */


/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#elif defined(__XTENSA__)
  /* anonymous unions are enabled by default */
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- CLKCTL3 Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL3_Peripheral_Access_Layer CLKCTL3 Peripheral Access Layer
 * @{
 */

/** CLKCTL3 - Register Layout Typedef */
typedef struct {
       uint8_t RESERVED_0[16];
  __IO uint32_t PSCCTL0_COMP;                      /**< VDD1_SENSE Peripheral Clock Control 0, offset: 0x10 */
       uint8_t RESERVED_1[44];
  __IO uint32_t PSCCTL0_COMP_SET;                  /**< VDD1_SENSE Peripheral Clock Control 0 Set, offset: 0x40 */
       uint8_t RESERVED_2[44];
  __IO uint32_t PSCCTL0_COMP_CLR;                  /**< VDD1_SENSE Peripheral Clock Control 0 Clear, offset: 0x70 */
       uint8_t RESERVED_3[28];
  __IO uint32_t ONE_SRC_CLKSLICE_ENABLE_COMP;      /**< One Source Clock Slice Enable for VDD2_COMP CPU, offset: 0x90 */
       uint8_t RESERVED_4[380];
  __I  uint32_t LPOSCCTL0;                         /**< Low Power Oscillator Control 0, offset: 0x210 */
  __I  uint32_t SENSEBASECLKSEL;                   /**< VDD1_SENSE Clock Source, offset: 0x214 */
       uint8_t RESERVED_5[120];
  __I  uint32_t FRO2CLKSTATUS;                     /**< FRO_TUNER2 Clock Status, offset: 0x290 */
       uint8_t RESERVED_6[4];
  __IO uint32_t FRO2MAXDOMAINEN;                   /**< FRO2MAX Clock Domain Enable, offset: 0x298 */
       uint8_t RESERVED_7[356];
  __IO uint32_t SENSEMAINCLKDIV;                   /**< VDD1_SENSE Main Clock Divider, offset: 0x400 */
       uint8_t RESERVED_8[48];
  __IO uint32_t MAINCLKSEL;                        /**< VDD1_SENSE Main Clock Source Select, offset: 0x434 */
       uint8_t RESERVED_9[24];
  __IO uint32_t SENSERAMCLKSEL;                    /**< VDD1_SENSE RAM Clock Source Select, offset: 0x450 */
       uint8_t RESERVED_10[8];
  __IO uint32_t SENSERAMCLKDIV;                    /**< VDD1_SENSE RAM Clock Divider, offset: 0x45C */
       uint8_t RESERVED_11[32];
  __IO uint32_t OSTIMERFCLKSEL;                    /**< OSTIMER Functional Clock Source Select, offset: 0x480 */
  __IO uint32_t OSTIMERFCLKDIV;                    /**< OSTIMER Functional Clock Divider, offset: 0x484 */
       uint8_t RESERVED_12[376];
  __IO uint32_t SDADCFCLKSEL;                      /**< SDADC Functional Clock Source Select, offset: 0x600 */
  __IO uint32_t SDADCFCLKDIV;                      /**< SDADC Functional Clock Divider, offset: 0x604 */
       uint8_t RESERVED_13[24];
  __IO uint32_t SARADCFCLKSEL;                     /**< ADC0 (SARADC) Functional Clock Source Select, offset: 0x620 */
  __IO uint32_t SARADCFCLKDIV;                     /**< ADC0 (SARADC) Functional Clock Divider, offset: 0x624 */
       uint8_t RESERVED_14[296];
  __IO uint32_t WAKE32KCLKSEL;                     /**< Wake 32 kHZ Clock Source Select, offset: 0x750 */
  __IO uint32_t WAKE32KCLKDIV;                     /**< Wake 32kHZ Clock Divider, offset: 0x754 */
       uint8_t RESERVED_15[40];
  __IO uint32_t MICFILFCLKSEL;                     /**< MICFIL Functional Clock Source Select, offset: 0x780 */
  __IO uint32_t MICFILFCLKDIV;                     /**< MICFIL Functional Clock Divider, offset: 0x784 */
  __IO uint32_t LPI2C15FCLKSEL;                    /**< LPI2C15 Functional Clock Source Select, offset: 0x788 */
  __IO uint32_t LPI2C15FCLKDIV;                    /**< LPI2C15 Functional Clock Divider, offset: 0x78C */
       uint8_t RESERVED_16[112];
  __IO uint32_t CLKOUTCLKSEL;                      /**< CLKOUT_VDD1 Clock Source Select, offset: 0x800 */
  __IO uint32_t CLKOUTCLKDIV;                      /**< CLKOUT_VDD1 Clock Divider, offset: 0x804 */
       uint8_t RESERVED_17[8];
  __IO uint32_t PSCCTL0_SENS;                      /**< VDD1_SENSE Peripheral Clock Control 0, offset: 0x810 */
       uint8_t RESERVED_18[44];
  __IO uint32_t PSCCTL0_SENS_SET;                  /**< VDD1_SENSE Peripheral Clock Control 0 Set, offset: 0x840 */
       uint8_t RESERVED_19[44];
  __IO uint32_t PSCCTL0_SENS_CLR;                  /**< VDD1_SENSE Peripheral Clock Control 0 Clear, offset: 0x870 */
       uint8_t RESERVED_20[28];
  __IO uint32_t ONE_SRC_CLKSLICE_ENABLE_SENSE;     /**< One Source Clock Slice Enable for VDD1_SENSE CPU, offset: 0x890 */
} CLKCTL3_Type;

/* ----------------------------------------------------------------------------
   -- CLKCTL3 Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup CLKCTL3_Register_Masks CLKCTL3 Register Masks
 * @{
 */

/*! @name PSCCTL0_COMP - VDD1_SENSE Peripheral Clock Control 0 */
/*! @{ */

#define CLKCTL3_PSCCTL0_COMP_CPU1_MASK           (0x1U)
#define CLKCTL3_PSCCTL0_COMP_CPU1_SHIFT          (0U)
/*! CPU1 - CPU1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_CPU1(x)             (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_CPU1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_CPU1_MASK)

#define CLKCTL3_PSCCTL0_COMP_MU0_MASK            (0x10U)
#define CLKCTL3_PSCCTL0_COMP_MU0_SHIFT           (4U)
/*! MU0 - MU0 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_MU0(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_MU0_SHIFT)) & CLKCTL3_PSCCTL0_COMP_MU0_MASK)

#define CLKCTL3_PSCCTL0_COMP_MU1_MASK            (0x20U)
#define CLKCTL3_PSCCTL0_COMP_MU1_SHIFT           (5U)
/*! MU1 - MU1 Clock
 *  0b0..Disable
 *  0b1..Enable
 */
#define CLKCTL3_PSCCTL0_COMP_MU1(x)              (((uint32_t)(((uint32_t)(x)) << CLKCTL3_PSCCTL0_COMP_MU1_SHIFT)) & CLKCTL3_PSCCTL0_COMP_MU1_MASK)

